Duet3D/RepRapFirmware/src/atmel/SAME54_DFP/1.1.134/edc/ATSAME54N20A.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PB31" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT15" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO7" edc:ppsfunction="G"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB00" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN12" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="X30" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y30" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="IN1" edc:ppsfunction="N"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="RTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB01" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN13" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="X31" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y31" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="IN2" edc:ppsfunction="N"/>
      <edc:VirtualPin edc:name="OUT" edc:ppsfunction="RTC"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB02" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN14" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="X20" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y20" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="N"/>
      <edc:VirtualPin edc:name="IN1" edc:ppsfunction="RTC"/>
      <edc:VirtualPin edc:name="OUT1" edc:ppsfunction="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB03" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN15" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="X21" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y21" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="VBAT" edc:ppsfunction="SUPC"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
